{
  "claim-notes-001.txt": "Patient John Smith submitted medical claim for emergency room visit on 01/15/2024. Diagnosis: acute myocardial infarction. Treatment included: ECG, troponin tests, cardiac catheterization, and stent placement. Hospital stay: 5 days in cardiac ICU. Medications prescribed: aspirin, clopidogrel, atorvastatin, metoprolol. Follow-up cardiology appointments scheduled. Preliminary assessment: covered under emergency medical provisions. Awaiting final pathology and discharge summary.",
  "claim-notes-002.txt": "Homeowner Sarah Johnson filed property claim following house fire on 01/10/2024. Fire origin: electrical fault in master bedroom. Affected areas: master bedroom (2000 sq ft), hallway (1500 sq ft), guest room (1200 sq ft). Structural damage assessment complete: $35,000. Contents loss documented: $10,000. Insurance adjuster visited site on 01/12/2024. Building code compliance verified. Claim APPROVED: $45,000 payment authorized for full restoration and contents replacement.",
  "claim-notes-003.txt": "Auto accident claim filed by Michael Chen for vehicle collision on 01/18/2024 at 2:45 PM on Interstate 405. Involved vehicles: 2022 Honda Civic (policyholder) and 2020 Tesla Model 3. Police report #2024-001847 filed. Damage estimate: $8,500 (front end, transmission fluid leak detected). Third-party liability being investigated. Medical records requested from Chen to assess injury claims. Photo documentation and witness statements collected.",
  "claim-notes-004.txt": "Life insurance claim filed for Emily Rodriguez - death occurred 01/05/2024 due to pre-existing condition (undisclosed type 2 diabetes). Policy review reveals material misrepresentation on application form dated 06/2022. Applicant failed to disclose chronic health condition per question 12 of medical history section. Beneficiary: David Rodriguez (spouse). Incontestable period expired 01/2024 (2-year mark). DENIED per policy clause 5.3: material misrepresentation voids coverage.",
  "claim-notes-008.txt": "Property damage claim from Jennifer Thompson following severe hailstorm on 01/12/2024. Roof damage: extensive shingle loss, gutter damage. Damage estimate: $15,000. Interior water damage: attic ($2,500), master bedroom ($1,250). Claim initially APPROVED for $18,750 on 01/15/2024. APPEAL filed 01/19/2024: homeowner disputes adjuster's assessment of water damage extent. Claims department reviewing new photographic evidence and contractor estimates. Re-evaluation in progress."
}
